# Dataframes testing code

In [72]:
import pandas as pd
df = pd.read_csv("Files/DisneylandReviews.csv", encoding="latin-1")
df

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

## Lookgin for data (loc tool)

In [73]:
df.head(6)
# Right here we can get the first 6 elements of the DF

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
5,670591897,3,2019-4,Singapore,"Have been to Disney World, Disneyland Anaheim ...",Disneyland_HongKong

In [74]:
df.tail(3)
# Right here we can get the last 3 elements of the DF

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris

In [75]:
df.loc[[0,40000, 200]] # We can search for Rows, also I can get specific rows
# It has this structure: df.loc[[Rows],[Columns]]

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
40000,155911904,3,2013-3,United Kingdom,This was our 2nd visit. Kids didn't seem to im...,Disneyland_Paris
200,653385350,5,2019-2,United States,Much smaller than the US versions and you can ...,Disneyland_HongKong

In [76]:
df.loc[[12]]

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
12,670376905,4,2019-4,Australia,"We spend two days, the second day went early t...",Disneyland_HongKong

In [77]:
df.loc[[1],['Rating']] # We gotta put the name of the column between ''

   Rating
1       4

In [78]:
df.loc[12:20,['Reviewer_Location', 'Rating']] # In this case we didn't had to put the [Row]
# We define the range of the row in the 12:20

   Reviewer_Location  Rating
12         Australia       4
13       Philippines       5
14         Australia       5
15    United Kingdom       3
16   Myanmar (Burma)       4
17    United Kingdom       3
18         Australia       4
19         Hong Kong       5
20    United Kingdom       5

In [79]:
# We can also get every row with the next expression
df.loc[:,['Reviewer_Location', 'Rating']] # With the : we get every row

          Reviewer_Location  Rating
0                 Australia       4
1               Philippines       4
2      United Arab Emirates       4
3                 Australia       4
4            United Kingdom       4
...                     ...     ...
42651        United Kingdom       5
42652                Canada       5
42653          South Africa       5
42654         United States       4
42655        United Kingdom       4

[42656 rows x 2 columns]

In [80]:
df.loc[[0],:] # I got the first row (0) with all their columns

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong

## Looking for data (iloc tool)

In [81]:
# We use iloc for get the columns by their index, not by their name, like...

df.iloc[[0,5,10],[0,2]] # I didn't have to put the name of the column, just the index of the same

    Review_ID Year_Month
0   670772142     2019-4
5   670591897     2019-4
10  670443403     2019-4

In [82]:
df.iloc[0:2,0:4] # I also can look for data without the double [],[]
# I just write the range for the row and the column separating with "," and then i'll get the data
# If i ask for data that doesn't exist, like column 100, but i only have 5, it'll only show the 5

   Review_ID  Rating Year_Month Reviewer_Location
0  670772142       4     2019-4         Australia
1  670682799       4     2019-5       Philippines

In [83]:
# We can also change the index of the dataframe

#df2 = df # Create a new df

#df2.index = df2['Rating']

#df2

In [84]:
# If i see df, its the same, i didn't change it
df

,Review_ID,Rating,Year_Month,Reviewer_Location,Review_Text,Branch
0,670772142,4,2019-4,Australia,If you've ever been to Disneyland anywhere you...,Disneyland_HongKong
1,670682799,4,2019-5,Philippines,Its been a while since d last time we visit HK...,Disneyland_HongKong
2,670623270,4,2019-4,United Arab Emirates,Thanks God it wasn t too hot or too humid wh...,Disneyland_HongKong
3,670607911,4,2019-4,Australia,HK Disneyland is a great compact park. Unfortu...,Disneyland_HongKong
4,670607296,4,2019-4,United Kingdom,"the location is not in the city, took around 1...",Disneyland_HongKong
...,...,...,...,...,...,...
42651,1765031,5,missing,United Kingdom,i went to disneyland paris in july 03 and thou...,Disneyland_Paris
42652,1659553,5,missing,Canada,2 adults and 1 child of 11 visited Disneyland ...,Disneyland_Paris
42653,1645894,5,missing,South Africa,My eleven year old daughter and myself went to...,Disneyland_Paris
42654,1618637,4,missing,United States,"This hotel, part of the Disneyland Paris compl...",Disneyland_Paris
42655,1536786,4,missing,United Kingdom,"I went to the Disneyparis resort, in 1996, wit...",Disneyland_Paris